#Задание 9 Замена подстроки. Дана строка. Замените в этой строке все цифры 1 на слово one.

s = input()
print(s.replace("@", "").replace("1", "one"))